<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.GoogleChrome</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://dl.google.com/chrome/mac/universal/stable/GGRO/googlechrome.dmg</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Google Chrome</string>
		<key>NAME</key>
		<string>Google Chrome</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Chrome is a fast, simple, and secure web browser, built for the modern web.</string>
			<key>display_name</key>
			<string>Google Chrome</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>RestartAction</key>
			<string>None</string>
			<key>unattended_install</key>
			<false/>
			<key>uninstallable</key>
			<true/>
			<key>category</key>
			<string>Web Browser</string>
			<key>icon_name</key>
			<string>Google Chrome.png</string>
			<key>developer</key>
			<string>Google</string>
			<key>minimum_os_version</key>
			<string>10.14</string>
			<key>postinstall_script</key>
			<string></string>
			<key>postuninstall_script</key>
			<string>#!/bin/bash

		sudo rm -rf /Applications/GoogleChrome.app</string>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.google-chrome</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.autopkg.download.googlechrome</key>
			<dict>
				<key>git_hash</key>
				<string>90342b929ae491c3d5e12065c30c321c121a70c6</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/GoogleChrome/GoogleChrome.download.recipe</string>
				<key>sha256_hash</key>
				<string>1a3ee2c631c7fe7bfbf341cd4c06312e8e3afffea907d6351a029d8dcd30375e</string>
			</dict>
			<key>com.github.autopkg.munki.google-chrome</key>
			<dict>
				<key>git_hash</key>
				<string>5f5db38265797f1754def56335de7bfc75811305</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/GoogleChrome/GoogleChrome.munki.recipe</string>
				<key>sha256_hash</key>
				<string>8fd2feaa1c196109ee3bc4149b2447936782336f913c39875a4ad6c3e6dc4baa</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
