<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.MicrosoftOneDrive</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOADURL</key>
		<string>https://go.microsoft.com/fwlink/?linkid=%PRODUCTID%</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Microsoft</string>
		<key>NAME</key>
		<string>OneDrive</string>
		<key>PRODUCTID</key>
		<string>823060</string>
		<key>SOFTWARETITLE</key>
		<string>OneDrive</string>
		<key>VENDOR</key>
		<string>Microsoft</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>RestartAction</key>
			<string>None</string>
			<key>category</key>
			<string>Office</string>
			<key>description</key>
			<string>Microsoft OneDrive keeps your files and photos backed up, protected, synced, and accessible on your Mac and across all your other devices. Easily share documents, photos, and other files with friends, family, and colleagues. Know that your files are safe with advanced security features that protect what’s important.</string>
			<key>developer</key>
			<string>Microsoft</string>
			<key>display_name</key>
			<string>OneDrive</string>
			<key>icon_name</key>
			<string>OneDrive.png</string>
			<key>minimum_os_version</key>
			<string>10.14.0</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string></string>
			<key>postuninstall_script</key>
			<string>#!/bin/bash

		sudo rm -rf /Applications/OneDrive.app</string>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.munki.microsoftonedrive</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.rtrouton.download.microsoftonedrive</key>
			<dict>
				<key>git_hash</key>
				<string>47aeca541bc55a0e0216ad524fcbda1aa80049a5</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/MicrosoftOneDrive/MicrosoftOneDrive.download.recipe</string>
				<key>sha256_hash</key>
				<string>7718c1c2296c2ea2705df6e7b4378c9d7619f85244be5d55c03f095e7a509e45</string>
			</dict>
			<key>com.github.rtrouton.munki.microsoftonedrive</key>
			<dict>
				<key>git_hash</key>
				<string>4099d387a2ffd6b29cd8fc8bca24dc78de47153c</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/MicrosoftOneDrive/MicrosoftOneDrive.munki.recipe</string>
				<key>sha256_hash</key>
				<string>02955336301a160e30e08b7e5a1531ab89295029d76b08bdc6485dd9569701ce</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
